{
    "tab1": {
        "tab": "Background",
        "description": "Imagine a gambler preparing to take a chance at the casino table. Suppose the gambler starts with an initial wealth of n dollars, and each roll of the dice is independent with a probability of winning or losing set at 50%. As a greedy gambler, when he wins a certain amount, he will double down, and when he loses, he will resolve to win back his original stake and continue gambling. The game ends when the gambler either loses all his funds or wins all the wealth of the casino (considered to be infinite).\n\nWe can represent the gambler's wealth on a number line, moving right by 1 unit when he wins a bet and moving left by 1 unit when he loses one. This creates a typical random walk scenario. Although the gambler’s wealth may increase or decrease at certain points, theoretically, as long as he continues to gamble, he will ultimately return to zero. This conclusion can be derived using difference equations, a phenomenon known as the recurrence of one-dimensional random walks.\n\nNow, with nothing left, the gambler decides to drink until he loses consciousness. After getting thoroughly drunk, he leaves his home and stumbles down the street. In this model, the drunkard walks in a two-dimensional space, with equal probabilities of moving in the up, down, left, or right directions at each step. While the drunkard may stray far from home in the short term, fortunately, given enough time, he almost always returns to the origin. This reflects the recurrence of two-dimensional random walks."
    },
    "tab2": {
        "tab": "Simulator",
        "panel": {
            "initialX":"",
            "initialY":""
        }
    },
    "tab3": {
        "tab": "Guide",
        "description": "We have provided a two-dimensional simulator. You can adjust the initial x and y coordinates, the maximum range along the x-axis, the movement interval, and whether to restrict it to one dimension, in order to simulate the random walk process. Sometimes it may take tens of thousands of steps to return to the origin."
    }
}