{
    "tab1": {
        "tab": "Background",
        "description": "The principle of 'majority rule' is a common decision-making strategy. In democratic elections, voters cast ballots to determine leaders; in talent shows, expert judges vote to evaluate contestants' performances; and in ensemble algorithms, multiple models are trained to vote on prediction outcomes. The underlying principle behind these scenarios is that even if individual judgments are not highly accurate, collective voting can lead to a highly accurate decision.\n\nHowever, the effectiveness of this collective wisdom relies on two critical conditions. The first is the ​accuracy threshold: each individual's accuracy must exceed 50%, meaning it surpasses random guessing. In other words, if each model or individual is more likely to make correct judgments, the voting process can enhance accuracy through the mechanism of 'errors canceling each other out and correct judgments reinforcing one another.' Conversely, if this condition is not met, the overall accuracy may decrease rather than improve.\n\nThe second important condition is the ​principle of independence: the decisions of individual models must be independent. When individuals have diverse perspectives, their errors tend to be randomly distributed, allowing majority voting to effectively filter out noise. However, if decisions are highly homogeneous, collective errors can form systematic biases, rendering the voting mechanism ineffective.\n\nIt is worth noting that even when these two conditions are met, collective decision-making does not always outperform the best individual. For example, consider two groups: one with extremely high accuracy but a small number of members, and another with slightly above 50% accuracy but a large number of members. After majority voting, the accuracy may fall somewhere between the two groups. In other words, voting can ensure a lower bound but does not guarantee an upper bound. This is why real-world evaluation systems often assign higher weights to experts or implement strict criteria for selecting voters."
    },
    "tab2": {
        "tab": "Simulator",
        "description": ""
    },
    "tab3": {
        "tab": "Guide",
        "description": "This simulator provides users with the flexibility to define group characteristics. Users can customize multiple groups, each with the following key parameters: ​accuracy rate​ (the probability of an individual making a correct judgment), ​size​ (the scale of the group), ​conformity rate​ (the proportion of individuals within the group who tend to maintain consistent choices), and ​weight​ (the coefficient that influences the group’s voting impact on the final decision). By combining these parameters, users can deeply explore the dynamic characteristics of group decision-making. The simulation results will be presented in an intuitive bar chart format, showcasing the outcome of majority voting as well as the independent accuracy distribution of each group."
    }
}